/* Написать программу работы с статическими массивами
Даны два статических массива  - одинаковый длины, например [1,2,3], [4,5,6]. Реализовать в виде функций следующие операции:
- инициализация статических массивов осуществляется на основе датчика случайных чисел
- поиск заданного числа в массиве, [1,1,2]  - число 1
- подсчет количества четных и нечетных чисел
- поиск min, max в массиве
- сортировка значений массива по возрастанию
- поиск пересечений двух массивов, [1,2,3], [2,3,4] - - >> [2,3]
-сложение значений двух массивов
Замечание 1. Использовать глобальные переменные  - можно!
Замечание 2. Показать передачу массивов в виде аргумента для функции, показать возвращение результата работы функции в виде массива
Замечание 3.При реализации сортировки запрещено использовать встроенные функции в GO
*/
package main

import (
	"fmt"
	"math/rand"
	"time"
)

var enter, odd, even, h, j int

func find(value []int) (summ int) {
	for i := range value {
		if value[i] == enter {
			summ++
		} else {
			continue
		}
	}
	return
}

func num(value []int) (int, int) {
	for i := range value {
		if value[i]%2 == 0 {
			even++
		} else {
			odd++
			continue
		}
	}
	return even, odd
}

func main() {
	rand.Seed(time.Now().UnixNano())
	arr1 := rand.Perm(20)
	arr2 := rand.Perm(20)
	fmt.Println("Какое число хотите найти в данных массивах?:")
	fmt.Scanln(&enter)
	fmt.Printf("Число %d повторяется в первом массиве %d раз, во втором %d раз\n", enter, find(arr1), find(arr2))ч
	fmt.Printf("Количество четных чисел в массиве %d, нечетных %d\n", num(arr1))
}
