// Написать программу: дан массив из 10 чисел, которые задаются с помощью датчика случайных чисел.
// Программа находит повторяющиеся элементы и считает количество повторений. Например дан массив {1,1,1,2,3,4,2,3,4} результат число 1,
// повторяется 3 раза, число 2 два раза, числа 3 два раза, число 4 два раза.
package main

import (
	"fmt"
	"math/rand"
	"time"
)

func main() {
	sum := 0
	z := 0
	rand.Seed(time.Now().UnixNano())
	//array := rand.Perm(20)
	array := [7]int{1, 1, 1, 2, 4, 4, 3}
	for _, x := range array {
		for z < len(array) {
			if x == array[z] {
				sum++
				z++
			} else {
				z++
			}
		}
		fmt.Printf("Количество %d повторяется %d разa\n", x, sum)
		sum = 0
		z = 0
	}

}
