/* Напишите функцию для подсчета частоты упоминания слов в строке текста и возвращения карты со словами и числом, указывающем, 
сколько раз они употребляются. Функция должна конвертировать текст в нижний регистр и обрезать знаки препинания. 
Используйте пакет strings. Функции, которые пригодятся для выполнения данного задания: Fields, ToLower и Trim.
Используйте функцию для подсчета частоты слов следующего отрывка текста и последующего вывода числа употребления каждого слова, 
что встречается более одного раза. */
package main

import (
    "fmt"
	"strings"
)

func main() {
	
}
